// 游玩订单状态
export const OrderState: any = {
  0: '待付款',
  1: '已完成',
  2: '已取消',
  3: '全部退货',
  4: '部分退货',
}

// 取消原因
export const CancelReason: any = {
  0: '无',
  1: '用户主动取消',
  2: '用户主动关闭',
  3: '订单超时自动关闭',
  4: '商家主动取消',
  5: '商家主动关闭'
}

// 充值订单状态
export const InvestState: any = {
  0: '待支付',
  1: '支付成功',
  2: '支付失败',
  4: '退款成功',
  5: '退款失败',
  6: '已取消'
}

// 创建充值订单失败原因
export const CreateChargeOrderErrorEnum: any = {
 0: '成功',
 1: '下单失败',
 2: '套餐不存在',
 3: '会员不存在',
 4: '会员未启用'
}

// 创建定单失败原因
export const CreatePlayOrderErrorEnum: any = {
  0: '成功',
  1: '失败',
  2: '商品信息有误',
  3: '会员不存在',
  4: '输入的收款金额不足',
  5: '不可使用积分',
  6: '会员积分不足',
  7: '门店暂不支持积分支付',
  8: '用户积分未满足积分使用条件',
  9: '订单金额未满足积分使用条件',
  10: '会员未启用',
  11: '无下单权限'
}

// 支付失败原因
export const PayErrorEnum: any = {
  0: '成功',
  1: '支付失败',
  2: '订单不存在',
  3: '余额不足',
  4: '付款码获取失败',
  5: '需要输入密码',
  6: '积分不足',
}

// 充值失败原因
export const ChargeErrorEnum: any = {
  0: '支付成功',
  1: '支付失败',
  2: '订单不存在',
  3: '需要输入密码',
  4: '付款码获取失败',
  5: '支付渠道为空',
  6: '余额不足',
}

// 会员等级，暂未启用
export const MemberLevel: any = {
  0: '普通会员',
  1: '1',
  2: '2',
  3: '3',
  4: '4',
  5: '5',
  6: '6',
}